const ObjectID = require('mongodb').ObjectID;
const Categories = [{
	// 0
	title: 'الطفل والصحة',
	subCategories: [{
		_id: new ObjectID(),
		title: 'الاطفال حديثي الولادة',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'تغذية الطفل',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الاسعافات الاولية',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الامراض الشائعة',
		Topics: []
	}]
}, {
	// 1
	title: 'الطفل والدين',
	subCategories: [{
		_id: new ObjectID(),
		title: 'الصلاة',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الحرام والحلال',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'السلوكيات والاخلاق',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'القرآن والحديث',
		Topics: []
	}]
}, {
	// 2
	title: 'التربية النفسية',
	subCategories: [{
		_id: new ObjectID(),
		title: 'العنف الأسري',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الثقة بالنفس',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'المراهقة',
		Topics: []
	}]
}, {
	// 3
	title: 'التربية الإجتماعية',
	subCategories: [{
		_id: new ObjectID(),
		title: 'الغربة للاطفال',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'العلاقة بين الاخوة',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الطفل والرجولة',
		Topics: []
	}]
}, {
	// 4
	title: 'التربية العلمية',
	subCategories: [{
		_id: new ObjectID(),
		title: 'الطفل والمدرسة',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الطفل و الفصحى',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الطفل والعادات والتقاليد',
		Topics: []
	}]
}, {
	// 5
	title: 'الطفل والتكنولوجيا',
	subCategories: [{
		_id: new ObjectID(),
		title: 'مخاطر التكنولوجيا للاطفال',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'الالعاب الاكترونية والطفل',
		Topics: []
	}, {
		_id: new ObjectID(),
		title: 'فوائد التكنولوجيا للاطفال',
		Topics: []
	}]
}, {
	// 6
	title: 'منوعات',
	subCategories: [{
		_id: new ObjectID(),
		title: 'الاطفال والرياضه',
		Topics: []
	}]
}];
const Topics = [{
	// الاطفال حديثى الولاده
	_id: new ObjectID(),
	title: 'عليكِ الذهاب الفورى إلى الطبيب',
	body: `بالتأكيد كل أم تكون حريصة وخائفة على مولودها الجديد، وغالباً ما تكون قلقة حول أى شىء يطرأ على مولودها، ولا تعلم متى تذهب للطبيب ومتى تنتظر بالبيت حتى موعد المتابعة الدورى، سنخبرك الآن عن بعض الأعراض التى يجب ألا تتجاهليها عندما تطرأ على طفلك حديثى الولادة:
- زرقة أو «ازرقاق» الشفتين:
إذا لاحظت أن شفاة طفلك، أو الأغشية المخاطية بفم طفلك، أو لسانه تحول للون الأزرق، فهذا يعنى أن طفلك لا يحصل على ما يكفيه من الأكسجين، وهنا عليكِ الذهاب الفورى إلى الطبيب أو لأقرب مستشفى.
- صعوبة وسرعة مستمرة فى تنفس طفلك:
إذا لاحظت صعوبة وسرعة تنفس طفلك بشكل مستمر، فربما تكون هذه علامة على ضيق بتنفسه، فهنا يجب عليكِ الذهاب للطبيب على الفور، وإذا كنتِ فى الليل يجب عليكِ الذهاب لطوارئ أقرب مستشفى.
- ارتفاع درجة حرارة طفلك حديثى الولادة عن 38 درجة مئوية:
إذا لاحظت ارتفاع درجة حرارة طفلك الذى عمره أقل من شهرين عن 38 درجة «سيلزيوس»، فينبغى عليكِ الذهاب للطبيب على الفور, واعلمى أن ارتفاع درجة حرارة حديثى الولادة لا تدل على شىء معين، فربما يكون مجرد نزلة برد وربما - لا قدر الله - تدل على مشكلة أخطر بكثير مثل التهاب السحايا.
*ملحوظة: يفضل قياس درجة حرارة طفلك حديثى الولادة عن طريق فتحة الشرج، فهى أدق من تحت الأبط أو من تحت اللسان.
- اصفرار بجلد طفلك «الصفراء»:
إذا لاحظت اصفرار بوجه طفلك حديثى الولادة، ثم بعد ذلك اصفرار ببياض عينه، ثم زاد الاصفرار لبقية جسمه، فلابد من الذهاب للطبيب على الفور، فهذا يعنى تفاقم الصفراء لدى طفلك.
*ملحوظة: فى كثير من الأحيان يصاب الطفل حديثى الولادة بالصفراء، والتى عادة ما تذهب من تلقاء نفسها بمرور الوقت, ولا تحتاج لعلاج, ولكن الصفراء  لابد من تقييمها من قبل الطبيب, وبخاصة إذا  لاحظت الأم ازدياد اصفرار جلد طفلها،
- الجفاف:
بالنسبة للطفل حديث الولادة، يمكن اكتشاف إصابته بالجفاف عن طريق عدم التبول، فمن الطبيعى أن الطفل حديث الولادة يبلل على الأقل حفاضة واحدة فى اليوم الأول من عمره، ثم حفاضتين فى اليوم الثانى وثلاثة حفاضات فى اليوم الثالث، حتى أنه يمكن أن يبلل 6 حفاضات فى اليوم السادس من عمره، وأيضا يمكن اكتشاف إصابة حديثى الولادة بالجفاف عن طريق ملاحظة جفاف فمه وخموله، وتكون عيناه غائرتان، وفى هذه الحالة عليكِ باستشارة الطبيب، فقد ينصحك بإعطائه محلول معالجة الجفاف، وتجنبى إعطائه أى شىء آخر من تلقاء نفسك.
- قئ طفلك لعصارة خضراء أو قئ يشبه لون القهوة الداكنة:
الأطفال حديثى الولادة يتقيؤن كثيراً، فربما يتقيؤن نتيجة للكحة الشديدة أو للبكاء الشديد أو للرضاعة الزائدة، فهذا أمر طبيعى، ولكن إذا  كان لون القئ يشبه العصارة الخضراء، أو يشبه القهوة الداكنة اللون، فقد يدل ذلك على مشكلة خطيرة لدى طفلك - لا قدر الله - مثل انسداد بالأمعاء، أو حدوث نزيف داخلى لطفلك.
أيضا تقئ طفلك بعد حدوث جرح برأسه قد يدل على حدوث ارتجاج برأسه - لا قدر الله، وأنصحك بالذهاب للطبيب عند حدوث إصابات برأس طفلك، مع وجود القئ، أو عدم وجوده للتأكد من سلامته.`,
	images: {
		link: 'https://docs.google.com/uc?id=0B4apFqsczb56NlViVGhaMDZWak0'
	},
	videos: [],
	subCategoryID: Categories[0].subCategories[0]._id
}, {
	// تغذية الاطفال
	_id: new ObjectID(),
	title: 'الأفوكادو ونمو طفلك',
	body: `- الأفوكادو في غذاء الطفل:
إحتلت فاكهة الأفوكادو المرتبة الأولى في لائحة ال "10 فواكه الأكثر أهمية للأطفال". فحسب الدراسات تركيبة هذه الفاكهة تؤمن مغذيات هامة يحتاجها جسم الطفل للنمو. فهي غنية بالدهون الجيدة التي تضمن نمو طبيعي للجهاز العصبي و دماغ الطفل. الأفوكادو مصدر للأوميغا 3، خالية من الصوديوم و من الكوليسترول. كما أنها تساعد في زيادة الوزن لدى الاطفال دون الوزن الطبيعي. ننصح البدء بإدخال الأفوكادو في غذاء الطفل على عمر 6 أشهر.
الأفوكادو لا تحتاج طبخ لأنها طرية، مجرد هرسها بالشوكة كافٍ. أعطي طفلك الافوكادو لوحدها في بادئ الأمر. بعد ذلك ممكن إمزجيي الافوكادو مع الموز الناضج أو أضيفيه الى الإيجاص المطبوخ. طريقة أخرى لتقديم الأفوكادو للطفل هي هرس الافوكادو مع فلفل أسود، بهار، ثوم و زبادي للحصول على صلصة، يمكن أن يغمس الطفل الخضار المسلوقة بصلصة الأفوكادو `,
	images: {
		link: 'https://docs.google.com/uc?id=0B4apFqsczb56Q0F1bjRzQ2pBT28'
	},
	videos: [],
	subCategoryID: Categories[0].subCategories[1]._id
}, {
	// اسعافات اولية
	_id: new ObjectID(),
	title: 'لسعات الحشرات',
	body: `اللسعة تكون نتيجة لسعة حشرات مثل النحل او العقارب في جلد الإنسان تؤدي الى جرح وأحيانا دخول السم في أوردتنا وهذا الامر  يجب ان
 ييستحوذ على اهتمامنا خاصة عند الخروج في نزهات في احضان الطبيعة والمتنزهات
الحشرات اللاسعة المنتشرة في بلادنا هي الدبور والزقرطة والناس الحساسون لسمها قد يتضررون كثيراً ويجب أن
لا يستهان بمثل هذا الوضع خاصة لأنه وقد ينتهي في بعض  الحالات بالموت خلال فتره زمنيه قصيرة
العلامات: في أعقاب اللسعة يظهر الم واحمرار وحكّه وسخونة موضعيه ثم انتفاخ ودرنه, وفي حالات أصعب تظهر حكه
في الحنجرة وبحة في الصوت وصعوبة في التنفس وألمٌ في البطن مع إسهال  وهنالك خطر تلوّث ثانوي بسبب تعرض الجرح للميكروبات وأيضا ثيتانوس وفي حالات حساسية زائدة, فان لسعة حيوانات سامه أو لسعات
 في منطقة العنق فانه بالإضافة إلى الأعراض السابقة  قد يظهر ورمٌ في جهاز التنفس ومن علاماته شحوب أو
ازرقاق وفقدان وعي, وهذه قد تنتهي أحيانا بالموت  إن أهم الأسس للوقاية من اللسعات هي الابتعاد عن أماكن تعج
 بالحشرات اللاسعة والانتباه والتأكد من عدم دخول الحشرات إلى كأس الشراب وينصح كل من عندهم حساسية زائدة اتخاذ
إجراءات وقاية لمنع ظهور أعراض مرافقه خطره نتيجة للدغه أو اللسعة مثل: حمل علامة تدل على حساسيتكم الزائدة والتزوّد بحقنه اوتوماتيكيه تحوي أفينبرين
 وهي ماده مضادة مانعه للحساسية الزائدة والتطعيم المضاد للحساسية الزائدة يمكن القيام ببعض العمليات التي من شانها ان تكون العلاج في غالبية الاحيان  إخراج الشوكة (الزّبانه) حالاً بعد اللدغة, لمنع استمرارية دخول السم
 زبانة النحله تستمر في ضخ السم لمدة (2-3) دقيقه إخراج الشوكة بالإظفار, او قشط مكان اللسعة
 ولا تحاولوا إخراجها بالضغط لان هذا يجعلها تدخل عميقاً تبريد الموضع بالماء البارد او الثلج لمدة ساعة
 دهن الموضع بمراهم يحوي ستروئيديم من العادات الشعبية دهن المكان بعصير ثوم او بصل
حيث يعتقد ان هذه المواد تبطل مفعول السم اذا ظهر ورم يجب تضميد الجرح بضمادة نظيفة
 اذا كانت اللدغة في اليد, يرجى ربطها بضمادة في مكان منخفض  عن مستوى القلب لابطاء وصول السم الى القلب
 تناول مسكنات الم حسب الوضع متى يجب التوجه الى الطبيب  إذا حدث تفاقم في الإعراض وساءت حالة الملدوغ
 إذا كان الملدوغ من أصحاب الحساسية الزائدة إذا تم حقن بالفينبرين, يجب الوصول الى العلاج الطبي بسرعة لان مفعوله يدوم 10 دقائق فقط..`,
	images: {
		link: 'https://docs.google.com/uc?id=0B4apFqsczb56bW96Z1FhenlTTXc'
	},
	videos: [],
	subCategoryID: Categories[0].subCategories[2]._id
}, {
	// امراض شائعه
	_id: new ObjectID(),
	title: 'السعال الديكى',
	body: ` السعال الديكى من الأمراض البكتيرية المعدية التى تصيب الأطفال والكبار ، و لكن يمثل خطراً أكبر حين يصيب الأطفال خاصة تحت عمر سنتين . فترة حضانة المرض : 7 الى 10 أيام . أعراض المرض : تبدأ بكحة خفيفة وعطس ورشح وحمى . وبعد أسبوعين ، تبدأ الكحة بالتحول على هيئة 5 إلى 10 نوبات كحة تنتهى بصوت أشبه بصياح الديك ؛ ومن هنا يرجع تسمية هذا المرض ، و تتكرر بمعدل كل ساعة تقريباً . تصل شدة السعال للقىء بعد  السعال ، و كذلك نزيف ما تحت الملتحمة بالعين ، و أحياناً الى كسر فى الضلوع . يتوفر  مصل السعال الديكى فى الوحدات الصحية ، حيث تم ضمه فى جدول  التطعيمات على هيئة التطعيم الثلاثى ضد التيتانوس و الدفترياً و السعال الديكى أول أربع جرعات فى 2-4-6-18 شهر . و هناك جرعة خامسة من سن 4 إلى 6 سنين . يعطى المصل وقاية من المرض فترة تصل إلى 5-10 سنين . لذا يصبح البالغين غير محميين من الإصابة ، و قد يلتقطوا العدوى و يمرروها لأطفال .`,
	images: {
		link: 'https://docs.google.com/uc?id=0B4apFqsczb56VXJwd2xpQWgzMXM'
	},
	videos: [],
	subCategoryID: Categories[0].subCategories[3]._id
}, {
	// الاطفال والرياضه
	_id: new ObjectID(),
	title: 'قـواعد السلامه لقيادة الدراجة',
	body: `تعتبر قيادة الدراجة من أكثر الأنشطة المحببة للأطفال من مختلف الأعمار، وبالإضافة إلى المرح الذي يصاحب قيادة الدراجة، فهي تعتبر أيضاً رياضة جيدة جداً تساعد الطفل على تحريك عضلات الجسم وتحسين الدورة الدموية، والآن بعد أن قمتي بتعليم طفلك قيادة الدراجة هناك خطوة واحدة قبل أن ينطلق بها، وهي توعيته بقواعد السلامة لتفادي أي حوادث أو إصابات.
. اخبري طفلك أن يكون دائما مرتدياً الخوذة أثناء ركوب الدراجة، والتى يجب أن تكون ذات قياس مناسب وتغطى جبهة الطفل، مع الوضع فى الاعتبار أيضاً أنها يجب أن تكون مربوطة جيداً، حتى تؤدى مهمة حماية رأس الطفل على أكمل وجه.
•	احرصى أن تكون دراجة طفلك ذات حجم مناسب له، وأن تكون حالتها جيدة، ويجب أن يتم فحص ضغط الهواء فى إطاررات الدراجة، والتأكد من أن الفرامل أيضاً تعمل جيداً.
•	يجب على طفلك أثناء ركوبه الدراجة أن يكون مرتديا ملابس ذات ألوان فاتحة أو قميص عاكس أثناء الظلام، حتى يراه قائدو السيارات جيدا، ويجب أيضا أن يكون الحذاء الذى يرتديه غير مفتوح من الأمام.
•	ويجب أن تنبهى طفلك جيدا أنه أثناء ركوبه للدراجة ألا يضع أى سماعات فى أذنيه ليتمكن من الانتباه إلى الطريق ومن تحذيرات قائدي السيارات.
•	على طفلك أن يفهم أنه لن يستطيع ركوب الدراجة إلا فى مكان تكونين أنتِ على دراية به، مع الحرص على تفادى المناطق أو الأماكن أو الشوارع التى تكون غير مستوية أو الطرق السريعة.
•	يجب على طفلك أيضاً أن يكون على دراية بقواعد الطريق، فعليه مثلاً أن يتوقف ولا يعبر الشارع بالدراجة بدون النظر فى الجهتين، يجب عليكِ أيضا أن تحذرى الطفل من القيام بأى حركات متهورة أثناء ركوبه الدراجة.
•	ضعى فى اعتبارك إذا كان عمر طفلك أقل من عشرة سنوات، فيفضل ألا يقود الدراجة في الشارع بمفرده، والأفضل أن يركبها في النادي أو مكان مغلق مثل حديقة المنزل.`,
	images: {
		link: 'https://docs.google.com/uc?id=0B4apFqsczb56U05BbUxkTXFMZHM'
	},
	videos: [],
	subCategoryID: Categories[6].subCategories[0]._id
}];

Categories.forEach(Category => {
	Category.subCategories.forEach(subCategory => {
		Topics.forEach(Topic => {
			if (Topic.subCategoryID == subCategory._id) {
				subCategory.Topics.push(Topic._id);
			}
		});
	});
});
module.exports = {
	Topics,
	Categories
};
